In [55]:
#This is a short reference guide based on https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html
#We match common SQL commands to PANDAS
import pandas as pd
import numpy as np

In [19]:
df1 = pd.DataFrame(data = {'num': [1, 2], 'name': ['dog', 'cat'], 'toy': ['bone', 'catnip']})

In [20]:
df2 = pd.DataFrame(data = {'name': ['cat', 'horse'], 'food': [6, 4]})

In [21]:
df1

  name  num     toy
0  dog    1    bone
1  cat    2  catnip

*JOIN and MERGE*

PD merge documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html
Essentially equivalent to JOIN function in SQL

How keywork describes type of merge:
- Left/right = use keys from left/right frame only 
- Outer = use keys from union of both frames
- Inner = use keys from intersection of both frames

In [22]:
#in this case, df1 is left and df2 is right (order of arguments)
pd.merge(df1, df2, how = 'left', on = 'name') 
#no horse because that is a right only df key

  name  num     toy  food
0  dog    1    bone   NaN
1  cat    2  catnip   6.0

In [23]:
#in this case, df1 is left and df2 is right (order of arguments)
pd.merge(df1, df2, how = 'right', on = 'name') 
#no dog because that is a left only df key

    name  num     toy  food
0    cat  2.0  catnip     6
1  horse  NaN     NaN     4

In [24]:
#in this case, df1 is left and df2 is right (order of arguments)
pd.merge(df1, df2, how = 'outer', on = 'name') 
#union of keys

    name  num     toy  food
0    dog  1.0    bone   NaN
1    cat  2.0  catnip   6.0
2  horse  NaN     NaN   4.0

In [25]:
#in this case, df1 is left and df2 is right (order of arguments)
pd.merge(df1, df2, how = 'inner', on = 'name') 
#intersection of keys

  name  num     toy  food
0  cat    2  catnip     6

*SELECT*

Select is done by passing a list of columns, to create a new column just assign it either directly or with an assign method.

In [27]:
df1[['name', 'toy']] #equivalent of SELECT name, toy

  name     toy
0  dog    bone
1  cat  catnip

In [30]:
df1['noise'] = ['bark', 'meow']
df1

  name  num     toy noise
0  dog    1    bone  bark
1  cat    2  catnip  meow

*WHERE*

Where is also done via a similar passing of conditions. You can use '|' for OR and '&' for AND.

In [32]:
df1[df1['num'] > 1]

  name  num     toy noise
1  cat    2  catnip  meow

In [35]:
df1[(df1['toy'] == 'bone') | (df1['noise'] == 'meow')] #OR operator

  name  num     toy noise
0  dog    1    bone  bark
1  cat    2  catnip  meow

*GROUP BY* 

Group by with count is accomplished via DataFrame.groupby([column(s)]).count()

You can also pass in a dictionary to the .agg() function to get other values like mean, size, of count.

In [52]:
#first just going to make the df bigger for the purpose of demonstration
more_animals = pd.DataFrame({'name': ['duck', 'frog', 'platypus'], 'num': [2,3,1], 'toy': ['ball', None, None], 'noise':['quack', 'ribbit', None]})
animal_df = df1.append(more_animals)
animal_df

       name   noise  num     toy
0       dog    bark    1    bone
1       cat    meow    2  catnip
0      duck   quack    2    ball
1      frog  ribbit    3    None
2  platypus    None    1    None

In [51]:
animal_df.groupby('num').count() #how many of each number of animal are there

     name  noise  toy
num
1       2      1    1
2       2      2    2
3       1      1    0

In [54]:
animal_df.groupby('toy')['name'].count()

toy
ball      1
bone      1
catnip    1
Name: name, dtype: int64